[Timeout] BlockStatement
src/components/ProtectedRoute.tsx:9:75
   children: React.ReactNode
 }
 
-export default function ProtectedRoute({ children }: ProtectedRouteProps) {
-  const { user, isLoading, loadUser } = useAuthStore()
-
-  useEffect(() => {
-    loadUser()
-  }, [loadUser])
-
-  if (isLoading) {
-    return (
-      <div className="min-h-screen flex items-center justify-center bg-gray-50 dark:bg-gray-900">
-        <div className="text-gray-600 dark:text-gray-300">読み込み中...</div>
-      </div>
-    )
-  }
-
-  if (!user) {
-    return <Navigate to="/login" replace />
-  }
-
-  return <>{children}</>
-}
+export default function ProtectedRoute({ children }: ProtectedRouteProps) {}
 

[Timeout] BlockStatement
src/components/ProtectedRoute.tsx:12:19
 export default function ProtectedRoute({ children }: ProtectedRouteProps) {
   const { user, isLoading, loadUser } = useAuthStore()
 
-  useEffect(() => {
-    loadUser()
-  }, [loadUser])
+  useEffect(() => {}, [loadUser])
 
   if (isLoading) {

[Timeout] ArrayDeclaration
src/components/ProtectedRoute.tsx:14:6
 
   useEffect(() => {
     loadUser()
-  }, [loadUser])
+  }, [])
 
   if (isLoading) {

[Timeout] BlockStatement
src/components/ProtectedRoute.tsx:16:18
     loadUser()
   }, [loadUser])
 
-  if (isLoading) {
-    return (
-      <div className="min-h-screen flex items-center justify-center bg-gray-50 dark:bg-gray-900">
-        <div className="text-gray-600 dark:text-gray-300">読み込み中...</div>
-      </div>
-    )
-  }
+  if (isLoading) {}
 
   if (!user) {

[Timeout] BlockStatement
src/components/ProtectedRoute.tsx:24:14
     )
   }
 
-  if (!user) {
-    return <Navigate to="/login" replace />
-  }
+  if (!user) {}
 
   return <>{children}</>
