[Timeout] BlockStatement
src/pages/LoginPage.tsx:11:54
   const { login, isLoading, error, clearError } = useAuthStore()
   const navigate = useNavigate()
 
-  const handleSubmit = async (e: React.FormEvent) => {
-    e.preventDefault()
-    try {
-      await login({ email, password })
-      navigate('/')
-    } catch {
-      // Error is handled by the store
-    }
-  }
+  const handleSubmit = async (e: React.FormEvent) => {}
 
   return (

[Timeout] BlockStatement
src/pages/LoginPage.tsx:13:9
 
   const handleSubmit = async (e: React.FormEvent) => {
     e.preventDefault()
-    try {
-      await login({ email, password })
-      navigate('/')
-    } catch {
+    try {} catch {
       // Error is handled by the store
     }

[Timeout] StringLiteral
src/pages/LoginPage.tsx:29:17
             ログイン
           </h2>
           <p className="mt-2 text-center text-sm text-gray-600 dark:text-gray-400">
-            または{' '}
+            または{""}
             <Link
               to="/register"

[Timeout] ConditionalExpression
src/pages/LoginPage.tsx:39:12
           </p>
         </div>
         <form className="mt-8 space-y-6" onSubmit={handleSubmit}>
-          {error && (
-            <div className="rounded-md bg-red-50 dark:bg-red-900/50 p-4">
-              <div className="text-sm text-red-700 dark:text-red-200">{error}</div>
-            </div>
-          )}
+          {true}
           <div className="rounded-md shadow-sm -space-y-px">
             <div>

[Timeout] ConditionalExpression
src/pages/LoginPage.tsx:39:12
           </p>
         </div>
         <form className="mt-8 space-y-6" onSubmit={handleSubmit}>
-          {error && (
-            <div className="rounded-md bg-red-50 dark:bg-red-900/50 p-4">
-              <div className="text-sm text-red-700 dark:text-red-200">{error}</div>
-            </div>
-          )}
+          {false}
           <div className="rounded-md shadow-sm -space-y-px">
             <div>

[Timeout] BlockStatement
src/pages/LoginPage.tsx:56:34
                 autoComplete="email"
                 required
                 value={email}
-                onChange={(e) => {
-                  setEmail(e.target.value)
-                  clearError()
-                }}
+                onChange={(e) => {}}
                 placeholder="メールアドレス"

[Timeout] BlockStatement
src/pages/LoginPage.tsx:75:34
                 autoComplete="current-password"
                 required
                 value={password}
-                onChange={(e) => {
-                  setPassword(e.target.value)
-                  clearError()
-                }}
+                onChange={(e) => {}}
                 placeholder="パスワード"
