[Timeout] StringLiteral
src/services/api.ts:4:12
 import axios from 'axios'
 
 const api = axios.create({
-  baseURL: 'http://localhost:3001/api',
+  baseURL: "",
   headers: {
     'Content-Type': 'application/json',

[Timeout] BlockStatement
src/services/api.ts:10:42
   },
 })
 
-api.interceptors.request.use((config) => {
-  const token = localStorage.getItem('token')
-  if (token) {
-    config.headers.Authorization = `Bearer ${token}`
-  }
-  return config
-})
+api.interceptors.request.use((config) => {})
 
 api.interceptors.response.use(

[Timeout] ConditionalExpression
src/services/api.ts:12:7
 
 api.interceptors.request.use((config) => {
   const token = localStorage.getItem('token')
-  if (token) {
+  if (true) {
     config.headers.Authorization = `Bearer ${token}`
   }

[Timeout] ConditionalExpression
src/services/api.ts:12:7
 
 api.interceptors.request.use((config) => {
   const token = localStorage.getItem('token')
-  if (token) {
+  if (false) {
     config.headers.Authorization = `Bearer ${token}`
   }

[Timeout] ArrowFunction
src/services/api.ts:19:3
 })
 
 api.interceptors.response.use(
-  (response) => response,
+  () => undefined,
   (error) => {
     if (error.response?.status === 401) {

[Timeout] BlockStatement
src/services/api.ts:20:14
 
 api.interceptors.response.use(
   (response) => response,
-  (error) => {
-    if (error.response?.status === 401) {
-      localStorage.removeItem('token')
-      localStorage.removeItem('user')
-      window.location.href = '/login'
-    }
-    return Promise.reject(error)
-  }
+  (error) => {}
 )
 

[Timeout] OptionalChaining
src/services/api.ts:21:9
 api.interceptors.response.use(
   (response) => response,
   (error) => {
-    if (error.response?.status === 401) {
+    if (error.response.status === 401) {
       localStorage.removeItem('token')
       localStorage.removeItem('user')

[Timeout] ConditionalExpression
src/services/api.ts:21:9
 api.interceptors.response.use(
   (response) => response,
   (error) => {
-    if (error.response?.status === 401) {
+    if (false) {
       localStorage.removeItem('token')
       localStorage.removeItem('user')
