[Timeout] BooleanLiteral
src/stores/authStore.ts:18:14
 
 export const useAuthStore = create<AuthState>((set) => ({
   user: null,
-  isLoading: false,
+  isLoading: true,
   error: null,
 

[Timeout] BlockStatement
src/stores/authStore.ts:21:33
   isLoading: false,
   error: null,
 
-  login: async (credentials) => {
-    set({ isLoading: true, error: null })
-    try {
-      const { data } = await api.post('/auth/login', credentials)
-      localStorage.setItem('token', data.token)
-      localStorage.setItem('user', JSON.stringify(data.user))
-      set({ user: data.user, isLoading: false })
-    } catch (error) {
-      const message = error instanceof Error ? error.message : 'ログインに失敗しました'
-      set({ error: message, isLoading: false })
-      throw error
-    }
-  },
+  login: async (credentials) => {},
 
   register: async (data) => {

[Timeout] BooleanLiteral
src/stores/authStore.ts:22:22
   error: null,
 
   login: async (credentials) => {
-    set({ isLoading: true, error: null })
+    set({ isLoading: false, error: null })
     try {
       const { data } = await api.post('/auth/login', credentials)

[Timeout] BlockStatement
src/stores/authStore.ts:23:9
 
   login: async (credentials) => {
     set({ isLoading: true, error: null })
-    try {
-      const { data } = await api.post('/auth/login', credentials)
-      localStorage.setItem('token', data.token)
-      localStorage.setItem('user', JSON.stringify(data.user))
-      set({ user: data.user, isLoading: false })
-    } catch (error) {
+    try {} catch (error) {
       const message = error instanceof Error ? error.message : 'ログインに失敗しました'
       set({ error: message, isLoading: false })

[Timeout] BooleanLiteral
src/stores/authStore.ts:27:41
       const { data } = await api.post('/auth/login', credentials)
       localStorage.setItem('token', data.token)
       localStorage.setItem('user', JSON.stringify(data.user))
-      set({ user: data.user, isLoading: false })
+      set({ user: data.user, isLoading: true })
     } catch (error) {
       const message = error instanceof Error ? error.message : 'ログインに失敗しました'

[Timeout] BlockStatement
src/stores/authStore.ts:28:21
       localStorage.setItem('token', data.token)
       localStorage.setItem('user', JSON.stringify(data.user))
       set({ user: data.user, isLoading: false })
-    } catch (error) {
-      const message = error instanceof Error ? error.message : 'ログインに失敗しました'
-      set({ error: message, isLoading: false })
-      throw error
-    }
+    } catch (error) {}
   },
 

[Timeout] BooleanLiteral
src/stores/authStore.ts:30:40
       set({ user: data.user, isLoading: false })
     } catch (error) {
       const message = error instanceof Error ? error.message : 'ログインに失敗しました'
-      set({ error: message, isLoading: false })
+      set({ error: message, isLoading: true })
       throw error
     }

[Timeout] ObjectLiteral
src/stores/authStore.ts:30:11
       set({ user: data.user, isLoading: false })
     } catch (error) {
       const message = error instanceof Error ? error.message : 'ログインに失敗しました'
-      set({ error: message, isLoading: false })
+      set({})
       throw error
     }

[Timeout] BlockStatement
src/stores/authStore.ts:35:29
     }
   },
 
-  register: async (data) => {
-    set({ isLoading: true, error: null })
-    try {
-      const response = await api.post('/auth/register', data)
-      localStorage.setItem('token', response.data.token)
-      localStorage.setItem('user', JSON.stringify(response.data.user))
-      set({ user: response.data.user, isLoading: false })
-    } catch (error) {
-      const message = error instanceof Error ? error.message : '登録に失敗しました'
-      set({ error: message, isLoading: false })
-      throw error
-    }
-  },
+  register: async (data) => {},
 
   logout: () => {

[Timeout] BooleanLiteral
src/stores/authStore.ts:36:22
   },
 
   register: async (data) => {
-    set({ isLoading: true, error: null })
+    set({ isLoading: false, error: null })
     try {
       const response = await api.post('/auth/register', data)

[Timeout] BlockStatement
src/stores/authStore.ts:37:9
 
   register: async (data) => {
     set({ isLoading: true, error: null })
-    try {
-      const response = await api.post('/auth/register', data)
-      localStorage.setItem('token', response.data.token)
-      localStorage.setItem('user', JSON.stringify(response.data.user))
-      set({ user: response.data.user, isLoading: false })
-    } catch (error) {
+    try {} catch (error) {
       const message = error instanceof Error ? error.message : '登録に失敗しました'
       set({ error: message, isLoading: false })

[Timeout] BooleanLiteral
src/stores/authStore.ts:41:50
       const response = await api.post('/auth/register', data)
       localStorage.setItem('token', response.data.token)
       localStorage.setItem('user', JSON.stringify(response.data.user))
-      set({ user: response.data.user, isLoading: false })
+      set({ user: response.data.user, isLoading: true })
     } catch (error) {
       const message = error instanceof Error ? error.message : '登録に失敗しました'

[Timeout] BlockStatement
src/stores/authStore.ts:42:21
       localStorage.setItem('token', response.data.token)
       localStorage.setItem('user', JSON.stringify(response.data.user))
       set({ user: response.data.user, isLoading: false })
-    } catch (error) {
-      const message = error instanceof Error ? error.message : '登録に失敗しました'
-      set({ error: message, isLoading: false })
-      throw error
-    }
+    } catch (error) {}
   },
 

[Timeout] BooleanLiteral
src/stores/authStore.ts:44:40
       set({ user: response.data.user, isLoading: false })
     } catch (error) {
       const message = error instanceof Error ? error.message : '登録に失敗しました'
-      set({ error: message, isLoading: false })
+      set({ error: message, isLoading: true })
       throw error
     }

[Timeout] ObjectLiteral
src/stores/authStore.ts:44:11
       set({ user: response.data.user, isLoading: false })
     } catch (error) {
       const message = error instanceof Error ? error.message : '登録に失敗しました'
-      set({ error: message, isLoading: false })
+      set({})
       throw error
     }

[Timeout] BlockStatement
src/stores/authStore.ts:49:17
     }
   },
 
-  logout: () => {
-    localStorage.removeItem('token')
-    localStorage.removeItem('user')
-    set({ user: null })
-  },
+  logout: () => {},
 
   loadUser: async () => {

[Timeout] ObjectLiteral
src/stores/authStore.ts:52:9
   logout: () => {
     localStorage.removeItem('token')
     localStorage.removeItem('user')
-    set({ user: null })
+    set({})
   },
 

[Timeout] BlockStatement
src/stores/authStore.ts:55:25
     set({ user: null })
   },
 
-  loadUser: async () => {
-    const token = localStorage.getItem('token')
-    if (!token) return
-
-    set({ isLoading: true })
-    try {
-      const { data } = await api.get('/auth/me')
-      set({ user: data, isLoading: false })
-    } catch {
-      localStorage.removeItem('token')
-      localStorage.removeItem('user')
-      set({ user: null, isLoading: false })
-    }
-  },
+  loadUser: async () => {},
 
   clearError: () => set({ error: null }),

[Timeout] StringLiteral
src/stores/authStore.ts:56:40
   },
 
   loadUser: async () => {
-    const token = localStorage.getItem('token')
+    const token = localStorage.getItem("")
     if (!token) return
 

[Timeout] BooleanLiteral
src/stores/authStore.ts:57:9
 
   loadUser: async () => {
     const token = localStorage.getItem('token')
-    if (!token) return
+    if (token) return
 
     set({ isLoading: true })

[Timeout] ConditionalExpression
src/stores/authStore.ts:57:9
 
   loadUser: async () => {
     const token = localStorage.getItem('token')
-    if (!token) return
+    if (true) return
 
     set({ isLoading: true })

[Timeout] BooleanLiteral
src/stores/authStore.ts:59:22
     const token = localStorage.getItem('token')
     if (!token) return
 
-    set({ isLoading: true })
+    set({ isLoading: false })
     try {
       const { data } = await api.get('/auth/me')

[Timeout] BlockStatement
src/stores/authStore.ts:60:9
     if (!token) return
 
     set({ isLoading: true })
-    try {
-      const { data } = await api.get('/auth/me')
-      set({ user: data, isLoading: false })
-    } catch {
+    try {} catch {
       localStorage.removeItem('token')
       localStorage.removeItem('user')

[Timeout] BooleanLiteral
src/stores/authStore.ts:62:36
     set({ isLoading: true })
     try {
       const { data } = await api.get('/auth/me')
-      set({ user: data, isLoading: false })
+      set({ user: data, isLoading: true })
     } catch {
       localStorage.removeItem('token')

[Timeout] ObjectLiteral
src/stores/authStore.ts:62:11
     set({ isLoading: true })
     try {
       const { data } = await api.get('/auth/me')
-      set({ user: data, isLoading: false })
+      set({})
     } catch {
       localStorage.removeItem('token')

[Timeout] BlockStatement
src/stores/authStore.ts:63:13
     try {
       const { data } = await api.get('/auth/me')
       set({ user: data, isLoading: false })
-    } catch {
-      localStorage.removeItem('token')
-      localStorage.removeItem('user')
-      set({ user: null, isLoading: false })
-    }
+    } catch {}
   },
 

[Timeout] StringLiteral
src/stores/authStore.ts:64:31
       const { data } = await api.get('/auth/me')
       set({ user: data, isLoading: false })
     } catch {
-      localStorage.removeItem('token')
+      localStorage.removeItem("")
       localStorage.removeItem('user')
       set({ user: null, isLoading: false })

[Timeout] StringLiteral
src/stores/authStore.ts:65:31
       set({ user: data, isLoading: false })
     } catch {
       localStorage.removeItem('token')
-      localStorage.removeItem('user')
+      localStorage.removeItem("")
       set({ user: null, isLoading: false })
     }

[Timeout] BooleanLiteral
src/stores/authStore.ts:66:36
     } catch {
       localStorage.removeItem('token')
       localStorage.removeItem('user')
-      set({ user: null, isLoading: false })
+      set({ user: null, isLoading: true })
     }
   },

[Killed] ArrowFunction
src/stores/authStore.ts:70:15
     }
   },
 
-  clearError: () => set({ error: null }),
+  clearError: () => undefined,
 }))
 
killedBy: All tests
statusReason: > client@0.0.0 test
> vitest run




 RUN  v4.1.10 /Users/yatabekotaro/local-repo/brain-training-app/client/.stryker-tmp/sandbox-3Xiulo

[Killed] ObjectLiteral
src/stores/authStore.ts:70:25
     }
   },
 
-  clearError: () => set({ error: null }),
+  clearError: () => set({}),
 }))
 
killedBy: All tests
statusReason: > client@0.0.0 test
> vitest run




 RUN  v4.1.10 /Users/yatabekotaro/local-repo/brain-training-app/client/.stryker-tmp/sandbox-3Xiulo
