[Timeout] OptionalChaining
src/pages/HomePage.tsx:15:16
           </h1>
           <div className="flex items-center space-x-4">
             <span className="text-gray-600 dark:text-gray-300">
-              {user?.displayName}
+              {user.displayName}
             </span>
             <button

[Timeout] OptionalChaining
src/pages/HomePage.tsx:30:21
         <div className="mx-auto max-w-7xl px-4 py-6 sm:px-6 lg:px-8">
           <div className="bg-white dark:bg-gray-800 shadow rounded-lg p-6">
             <h2 className="text-xl font-semibold text-gray-900 dark:text-white mb-4">
-              ようこそ、{user?.displayName}さん！
+              ようこそ、{user.displayName}さん！
             </h2>
             <p className="text-gray-600 dark:text-gray-300">

[Timeout] BlockStatement
src/pages/HomePage.tsx:49:83
   )
 }
 
-function GameCard({ title, description }: { title: string; description: string }) {
-  return (
-    <div className="bg-white dark:bg-gray-800 shadow rounded-lg p-6 hover:shadow-lg transition-shadow cursor-pointer">
-      <h3 className="text-lg font-medium text-gray-900 dark:text-white">{title}</h3>
-      <p className="mt-2 text-sm text-gray-600 dark:text-gray-400">{description}</p>
-    </div>
-  )
-}
+function GameCard({ title, description }: { title: string; description: string }) {}
 
