[Killed] BlockStatement
src/controllers/auth.controller.ts:7:47
 import type { AuthRequest } from '../middleware/auth.js'
 
 export const authController = {
-  async register(req: Request, res: Response) {
-    try {
-      const data = registerSchema.parse(req.body)
-      const result = await authService.register(data)
-      res.status(201).json(result)
-    } catch (error) {
-      if (error instanceof AuthError) {
-        res.status(error.statusCode).json({ error: error.message })
-      } else if (error instanceof Error) {
-        res.status(400).json({ error: error.message })
-      } else {
-        res.status(500).json({ error: 'サーバーエラーが発生しました' })
-      }
-    }
-  },
+  async register(req: Request, res: Response) {},
 
   async login(req: Request, res: Response) {
killedBy: All tests
statusReason: > server@1.0.0 test
> vitest run




 RUN  v4.1.10 /Users/yatabekotaro/local-repo/brain-training-app/server/.stryker-tmp/sandbox-I1yYQg

[Killed] BlockStatement
src/controllers/auth.controller.ts:8:9
 
 export const authController = {
   async register(req: Request, res: Response) {
-    try {
-      const data = registerSchema.parse(req.body)
-      const result = await authService.register(data)
-      res.status(201).json(result)
-    } catch (error) {
+    try {} catch (error) {
       if (error instanceof AuthError) {
         res.status(error.statusCode).json({ error: error.message })
killedBy: All tests
statusReason: > server@1.0.0 test
> vitest run




 RUN  v4.1.10 /Users/yatabekotaro/local-repo/brain-training-app/server/.stryker-tmp/sandbox-I1yYQg

[Killed] BlockStatement
src/controllers/auth.controller.ts:12:21
       const data = registerSchema.parse(req.body)
       const result = await authService.register(data)
       res.status(201).json(result)
-    } catch (error) {
-      if (error instanceof AuthError) {
-        res.status(error.statusCode).json({ error: error.message })
-      } else if (error instanceof Error) {
-        res.status(400).json({ error: error.message })
-      } else {
-        res.status(500).json({ error: 'サーバーエラーが発生しました' })
-      }
-    }
+    } catch (error) {}
   },
 
killedBy: All tests
statusReason: > server@1.0.0 test
> vitest run




 RUN  v4.1.10 /Users/yatabekotaro/local-repo/brain-training-app/server/.stryker-tmp/sandbox-I1yYQg

[Killed] ConditionalExpression
src/controllers/auth.controller.ts:13:11
       const result = await authService.register(data)
       res.status(201).json(result)
     } catch (error) {
-      if (error instanceof AuthError) {
+      if (true) {
         res.status(error.statusCode).json({ error: error.message })
       } else if (error instanceof Error) {
killedBy: All tests
statusReason: > server@1.0.0 test
> vitest run




 RUN  v4.1.10 /Users/yatabekotaro/local-repo/brain-training-app/server/.stryker-tmp/sandbox-I1yYQg

[Killed] ConditionalExpression
src/controllers/auth.controller.ts:13:11
       const result = await authService.register(data)
       res.status(201).json(result)
     } catch (error) {
-      if (error instanceof AuthError) {
+      if (false) {
         res.status(error.statusCode).json({ error: error.message })
       } else if (error instanceof Error) {
killedBy: All tests
statusReason: > server@1.0.0 test
> vitest run




 RUN  v4.1.10 /Users/yatabekotaro/local-repo/brain-training-app/server/.stryker-tmp/sandbox-I1yYQg

[Killed] BlockStatement
src/controllers/auth.controller.ts:15:42
     } catch (error) {
       if (error instanceof AuthError) {
         res.status(error.statusCode).json({ error: error.message })
-      } else if (error instanceof Error) {
-        res.status(400).json({ error: error.message })
-      } else {
+      } else if (error instanceof Error) {} else {
         res.status(500).json({ error: 'サーバーエラーが発生しました' })
       }
killedBy: All tests
statusReason: > server@1.0.0 test
> vitest run



 RUN  v4.1.10 /Users/yatabekotaro/local-repo/brain-training-app/server/.stryker-tmp/sandbox-I1yYQg

[Killed] ConditionalExpression
src/controllers/auth.controller.ts:15:18
     } catch (error) {
       if (error instanceof AuthError) {
         res.status(error.statusCode).json({ error: error.message })
-      } else if (error instanceof Error) {
+      } else if (false) {
         res.status(400).json({ error: error.message })
       } else {
killedBy: All tests
statusReason: > server@1.0.0 test
> vitest run




 RUN  v4.1.10 /Users/yatabekotaro/local-repo/brain-training-app/server/.stryker-tmp/sandbox-I1yYQg

[Survived] ObjectLiteral
src/controllers/auth.controller.ts:16:30
       if (error instanceof AuthError) {
         res.status(error.statusCode).json({ error: error.message })
       } else if (error instanceof Error) {
-        res.status(400).json({ error: error.message })
+        res.status(400).json({})
       } else {
         res.status(500).json({ error: 'サーバーエラーが発生しました' })

[Survived] BlockStatement
src/controllers/auth.controller.ts:17:14
         res.status(error.statusCode).json({ error: error.message })
       } else if (error instanceof Error) {
         res.status(400).json({ error: error.message })
-      } else {
-        res.status(500).json({ error: 'サーバーエラーが発生しました' })
-      }
+      } else {}
     }
   },

[Killed] BlockStatement
src/controllers/auth.controller.ts:23:44
     }
   },
 
-  async login(req: Request, res: Response) {
-    try {
-      const data = loginSchema.parse(req.body)
-      const result = await authService.login(data)
-      res.json(result)
-    } catch (error) {
-      if (error instanceof AuthError) {
-        res.status(error.statusCode).json({ error: error.message })
-      } else if (error instanceof Error) {
-        res.status(400).json({ error: error.message })
-      } else {
-        res.status(500).json({ error: 'サーバーエラーが発生しました' })
-      }
-    }
-  },
+  async login(req: Request, res: Response) {},
 
   async getProfile(req: AuthRequest, res: Response) {
killedBy: All tests
statusReason: > server@1.0.0 test
> vitest run




 RUN  v4.1.10 /Users/yatabekotaro/local-repo/brain-training-app/server/.stryker-tmp/sandbox-I1yYQg

[Killed] BlockStatement
src/controllers/auth.controller.ts:24:9
   },
 
   async login(req: Request, res: Response) {
-    try {
-      const data = loginSchema.parse(req.body)
-      const result = await authService.login(data)
-      res.json(result)
-    } catch (error) {
+    try {} catch (error) {
       if (error instanceof AuthError) {
         res.status(error.statusCode).json({ error: error.message })
killedBy: All tests
statusReason: > server@1.0.0 test
> vitest run




 RUN  v4.1.10 /Users/yatabekotaro/local-repo/brain-training-app/server/.stryker-tmp/sandbox-I1yYQg

[Killed] BlockStatement
src/controllers/auth.controller.ts:28:21
       const data = loginSchema.parse(req.body)
       const result = await authService.login(data)
       res.json(result)
-    } catch (error) {
-      if (error instanceof AuthError) {
-        res.status(error.statusCode).json({ error: error.message })
-      } else if (error instanceof Error) {
-        res.status(400).json({ error: error.message })
-      } else {
-        res.status(500).json({ error: 'サーバーエラーが発生しました' })
-      }
-    }
+    } catch (error) {}
   },
 
killedBy: All tests
statusReason: > server@1.0.0 test
> vitest run




 RUN  v4.1.10 /Users/yatabekotaro/local-repo/brain-training-app/server/.stryker-tmp/sandbox-I1yYQg

[Killed] BlockStatement
src/controllers/auth.controller.ts:29:39
       const result = await authService.login(data)
       res.json(result)
     } catch (error) {
-      if (error instanceof AuthError) {
-        res.status(error.statusCode).json({ error: error.message })
-      } else if (error instanceof Error) {
+      if (error instanceof AuthError) {} else if (error instanceof Error) {
         res.status(400).json({ error: error.message })
       } else {
killedBy: All tests
statusReason: > server@1.0.0 test
> vitest run




 RUN  v4.1.10 /Users/yatabekotaro/local-repo/brain-training-app/server/.stryker-tmp/sandbox-I1yYQg

[Survived] ObjectLiteral
src/controllers/auth.controller.ts:30:43
       res.json(result)
     } catch (error) {
       if (error instanceof AuthError) {
-        res.status(error.statusCode).json({ error: error.message })
+        res.status(error.statusCode).json({})
       } else if (error instanceof Error) {
         res.status(400).json({ error: error.message })

[Survived] ConditionalExpression
src/controllers/auth.controller.ts:31:18
     } catch (error) {
       if (error instanceof AuthError) {
         res.status(error.statusCode).json({ error: error.message })
-      } else if (error instanceof Error) {
+      } else if (true) {
         res.status(400).json({ error: error.message })
       } else {

[Killed] BlockStatement
src/controllers/auth.controller.ts:39:53
     }
   },
 
-  async getProfile(req: AuthRequest, res: Response) {
-    try {
-      if (!req.userId) {
-        res.status(401).json({ error: '認証が必要です' })
-        return
-      }
-
-      const profile = await authService.getProfile(req.userId)
-      res.json(profile)
-    } catch (error) {
-      if (error instanceof AuthError) {
-        res.status(error.statusCode).json({ error: error.message })
-      } else {
-        res.status(500).json({ error: 'サーバーエラーが発生しました' })
-      }
-    }
-  },
+  async getProfile(req: AuthRequest, res: Response) {},
 }
 
killedBy: All tests
statusReason: > server@1.0.0 test
> vitest run



 RUN  v4.1.10 /Users/yatabekotaro/local-repo/brain-training-app/server/.stryker-tmp/sandbox-I1yYQg

[Killed] BlockStatement
src/controllers/auth.controller.ts:40:9
   },
 
   async getProfile(req: AuthRequest, res: Response) {
-    try {
-      if (!req.userId) {
-        res.status(401).json({ error: '認証が必要です' })
-        return
-      }
-
-      const profile = await authService.getProfile(req.userId)
-      res.json(profile)
-    } catch (error) {
+    try {} catch (error) {
       if (error instanceof AuthError) {
         res.status(error.statusCode).json({ error: error.message })
killedBy: All tests
statusReason: > server@1.0.0 test
> vitest run




 RUN  v4.1.10 /Users/yatabekotaro/local-repo/brain-training-app/server/.stryker-tmp/sandbox-I1yYQg

[Killed] BooleanLiteral
src/controllers/auth.controller.ts:41:11
 
   async getProfile(req: AuthRequest, res: Response) {
     try {
-      if (!req.userId) {
+      if (req.userId) {
         res.status(401).json({ error: '認証が必要です' })
         return
killedBy: All tests
statusReason: > server@1.0.0 test
> vitest run



 RUN  v4.1.10 /Users/yatabekotaro/local-repo/brain-training-app/server/.stryker-tmp/sandbox-I1yYQg

[Killed] BlockStatement
src/controllers/auth.controller.ts:41:24
 
   async getProfile(req: AuthRequest, res: Response) {
     try {
-      if (!req.userId) {
-        res.status(401).json({ error: '認証が必要です' })
-        return
-      }
+      if (!req.userId) {}
 
       const profile = await authService.getProfile(req.userId)
killedBy: All tests
statusReason: > server@1.0.0 test
> vitest run




 RUN  v4.1.10 /Users/yatabekotaro/local-repo/brain-training-app/server/.stryker-tmp/sandbox-I1yYQg

[Survived] BlockStatement
src/controllers/auth.controller.ts:48:21
 
       const profile = await authService.getProfile(req.userId)
       res.json(profile)
-    } catch (error) {
-      if (error instanceof AuthError) {
-        res.status(error.statusCode).json({ error: error.message })
-      } else {
-        res.status(500).json({ error: 'サーバーエラーが発生しました' })
-      }
-    }
+    } catch (error) {}
   },
 }

[Survived] BlockStatement
src/controllers/auth.controller.ts:49:39
       const profile = await authService.getProfile(req.userId)
       res.json(profile)
     } catch (error) {
-      if (error instanceof AuthError) {
-        res.status(error.statusCode).json({ error: error.message })
-      } else {
+      if (error instanceof AuthError) {} else {
         res.status(500).json({ error: 'サーバーエラーが発生しました' })
       }

[Survived] BlockStatement
src/controllers/auth.controller.ts:51:14
     } catch (error) {
       if (error instanceof AuthError) {
         res.status(error.statusCode).json({ error: error.message })
-      } else {
-        res.status(500).json({ error: 'サーバーエラーが発生しました' })
-      }
+      } else {}
     }
   },
