[Killed] BlockStatement
src/middleware/auth.ts:8:83
   userId?: string
 }
 
-export function authenticate(req: AuthRequest, res: Response, next: NextFunction) {
-  try {
-    const authHeader = req.headers.authorization
-
-    if (!authHeader || !authHeader.startsWith('Bearer ')) {
-      throw new AuthError('認証トークンがありません', 401)
-    }
-
-    const token = authHeader.split(' ')[1]
-    const { userId } = verifyToken(token)
-
-    req.userId = userId
-    next()
-  } catch (error) {
-    if (error instanceof AuthError) {
-      res.status(error.statusCode).json({ error: error.message })
-    } else {
-      res.status(401).json({ error: '認証に失敗しました' })
-    }
-  }
-}
+export function authenticate(req: AuthRequest, res: Response, next: NextFunction) {}
 
killedBy: All tests
statusReason: > server@1.0.0 test
> vitest run




 RUN  v4.1.10 /Users/yatabekotaro/local-repo/brain-training-app/server/.stryker-tmp/sandbox-I1yYQg

[Killed] BlockStatement
src/middleware/auth.ts:9:7
 }
 
 export function authenticate(req: AuthRequest, res: Response, next: NextFunction) {
-  try {
-    const authHeader = req.headers.authorization
-
-    if (!authHeader || !authHeader.startsWith('Bearer ')) {
-      throw new AuthError('認証トークンがありません', 401)
-    }
-
-    const token = authHeader.split(' ')[1]
-    const { userId } = verifyToken(token)
-
-    req.userId = userId
-    next()
-  } catch (error) {
+  try {} catch (error) {
     if (error instanceof AuthError) {
       res.status(error.statusCode).json({ error: error.message })
killedBy: All tests
statusReason: > server@1.0.0 test
> vitest run



 RUN  v4.1.10 /Users/yatabekotaro/local-repo/brain-training-app/server/.stryker-tmp/sandbox-I1yYQg

[Killed] BlockStatement
src/middleware/auth.ts:12:59
   try {
     const authHeader = req.headers.authorization
 
-    if (!authHeader || !authHeader.startsWith('Bearer ')) {
-      throw new AuthError('認証トークンがありません', 401)
-    }
+    if (!authHeader || !authHeader.startsWith('Bearer ')) {}
 
     const token = authHeader.split(' ')[1]
killedBy: All tests
statusReason: > server@1.0.0 test
> vitest run




 RUN  v4.1.10 /Users/yatabekotaro/local-repo/brain-training-app/server/.stryker-tmp/sandbox-I1yYQg

[Survived] StringLiteral
src/middleware/auth.ts:13:27
     const authHeader = req.headers.authorization
 
     if (!authHeader || !authHeader.startsWith('Bearer ')) {
-      throw new AuthError('認証トークンがありません', 401)
+      throw new AuthError("", 401)
     }
 

[Killed] BlockStatement
src/middleware/auth.ts:21:19
 
     req.userId = userId
     next()
-  } catch (error) {
-    if (error instanceof AuthError) {
-      res.status(error.statusCode).json({ error: error.message })
-    } else {
-      res.status(401).json({ error: '認証に失敗しました' })
-    }
-  }
+  } catch (error) {}
 }
 
killedBy: All tests
statusReason: > server@1.0.0 test
> vitest run




 RUN  v4.1.10 /Users/yatabekotaro/local-repo/brain-training-app/server/.stryker-tmp/sandbox-I1yYQg

[Survived] BlockStatement
src/middleware/auth.ts:24:12
   } catch (error) {
     if (error instanceof AuthError) {
       res.status(error.statusCode).json({ error: error.message })
-    } else {
-      res.status(401).json({ error: '認証に失敗しました' })
-    }
+    } else {}
   }
 }

[Survived] ObjectLiteral
src/middleware/auth.ts:25:28
     if (error instanceof AuthError) {
       res.status(error.statusCode).json({ error: error.message })
     } else {
-      res.status(401).json({ error: '認証に失敗しました' })
+      res.status(401).json({})
     }
   }
