[Killed] StringLiteral
src/app.ts:12:9
 
 app.use('/api/auth', authRoutes)
 
-app.get('/health', (_, res) => {
+app.get("", (_, res) => {
   res.json({ status: 'ok', timestamp: new Date().toISOString() })
 })
killedBy: All tests
statusReason: > server@1.0.0 test
> vitest run




 RUN  v4.1.10 /Users/yatabekotaro/local-repo/brain-training-app/server/.stryker-tmp/sandbox-jZwTDr

[Killed] StringLiteral
src/app.ts:13:22
 app.use('/api/auth', authRoutes)
 
 app.get('/health', (_, res) => {
-  res.json({ status: 'ok', timestamp: new Date().toISOString() })
+  res.json({ status: "", timestamp: new Date().toISOString() })
 })
 
killedBy: All tests
statusReason: > server@1.0.0 test
> vitest run



 RUN  v4.1.10 /Users/yatabekotaro/local-repo/brain-training-app/server/.stryker-tmp/sandbox-jZwTDr

[Survived] ObjectLiteral
src/app.ts:18:24
 
 app.use((err: Error, _: express.Request, res: express.Response, _next: express.NextFunction) => {
   console.error('Unhandled error:', err)
-  res.status(500).json({ error: 'サーバーエラーが発生しました' })
+  res.status(500).json({})
 })
 
