[Survived] ObjectLiteral
src/config/env.ts:6:28
 
 dotenv.config()
 
-const envSchema = z.object({
-  DATABASE_URL: z.string(),
-  JWT_SECRET: z.string(),
-  JWT_EXPIRES_IN: z.string().default('7d'),
-  PORT: z.coerce.number().default(3001),
-  NODE_ENV: z.enum(['development', 'production', 'test']).default('development'),
-})
+const envSchema = z.object({})
 
 export const env = envSchema.parse(process.env)

[Survived] StringLiteral
src/config/env.ts:11:50
   JWT_SECRET: z.string(),
   JWT_EXPIRES_IN: z.string().default('7d'),
   PORT: z.coerce.number().default(3001),
-  NODE_ENV: z.enum(['development', 'production', 'test']).default('development'),
+  NODE_ENV: z.enum(['development', 'production', ""]).default('development'),
 })
 
