[Killed] BlockStatement
src/services/auth.service.ts:23:23
       where: { email: data.email },
     })
 
-    if (existingUser) {
-      throw new AuthError('このメールアドレスは既に使用されています', 409)
-    }
+    if (existingUser) {}
 
     const passwordHash = await bcrypt.hash(data.password, 12)
killedBy: All tests
statusReason: > server@1.0.0 test
> vitest run




 RUN  v4.1.10 /Users/yatabekotaro/local-repo/brain-training-app/server/.stryker-tmp/sandbox-I1yYQg

[Killed] BooleanLiteral
src/services/auth.service.ts:38:22
       select: {
         id: true,
         email: true,
-        displayName: true,
+        displayName: false,
         createdAt: true,
       },
killedBy: All tests
statusReason: > server@1.0.0 test
> vitest run




 RUN  v4.1.10 /Users/yatabekotaro/local-repo/brain-training-app/server/.stryker-tmp/sandbox-I1yYQg

[Killed] BooleanLiteral
src/services/auth.service.ts:39:20
         id: true,
         email: true,
         displayName: true,
-        createdAt: true,
+        createdAt: false,
       },
     })
killedBy: All tests
statusReason: > server@1.0.0 test
> vitest run




 RUN  v4.1.10 /Users/yatabekotaro/local-repo/brain-training-app/server/.stryker-tmp/sandbox-I1yYQg

[Killed] ObjectLiteral
src/services/auth.service.ts:45:12
 
     const token = generateToken(user.id)
 
-    return { user, token }
+    return {}
   },
 
killedBy: All tests
statusReason: > server@1.0.0 test
> vitest run




 RUN  v4.1.10 /Users/yatabekotaro/local-repo/brain-training-app/server/.stryker-tmp/sandbox-I1yYQg

[Survived] StringLiteral
src/services/auth.service.ts:54:27
     })
 
     if (!user) {
-      throw new AuthError('メールアドレスまたはパスワードが正しくありません', 401)
+      throw new AuthError("", 401)
     }
 

[Killed] ConditionalExpression
src/services/auth.service.ts:59:9
 
     const isValidPassword = await bcrypt.compare(data.password, user.passwordHash)
 
-    if (!isValidPassword) {
+    if (true) {
       throw new AuthError('メールアドレスまたはパスワードが正しくありません', 401)
     }
killedBy: All tests
statusReason: > server@1.0.0 test
> vitest run



 RUN  v4.1.10 /Users/yatabekotaro/local-repo/brain-training-app/server/.stryker-tmp/sandbox-I1yYQg

[Killed] ConditionalExpression
src/services/auth.service.ts:59:9
 
     const isValidPassword = await bcrypt.compare(data.password, user.passwordHash)
 
-    if (!isValidPassword) {
+    if (false) {
       throw new AuthError('メールアドレスまたはパスワードが正しくありません', 401)
     }
killedBy: All tests
statusReason: > server@1.0.0 test
> vitest run



 RUN  v4.1.10 /Users/yatabekotaro/local-repo/brain-training-app/server/.stryker-tmp/sandbox-I1yYQg

[Survived] ObjectLiteral
src/services/auth.service.ts:66:13
     const token = generateToken(user.id)
 
     return {
-      user: {
-        id: user.id,
-        email: user.email,
-        displayName: user.displayName,
-        createdAt: user.createdAt,
-      },
+      user: {},
       token,
     }

[Killed] BlockStatement
src/services/auth.service.ts:76:36
     }
   },
 
-  async getProfile(userId: string) {
-    const user = await prisma.user.findUnique({
-      where: { id: userId },
-      select: {
-        id: true,
-        email: true,
-        displayName: true,
-        avatarUrl: true,
-        createdAt: true,
-        updatedAt: true,
-      },
-    })
-
-    if (!user) {
-      throw new AuthError('ユーザーが見つかりません', 404)
-    }
-
-    return user
-  },
+  async getProfile(userId: string) {},
 }
 
killedBy: All tests
statusReason: > server@1.0.0 test
> vitest run




 RUN  v4.1.10 /Users/yatabekotaro/local-repo/brain-training-app/server/.stryker-tmp/sandbox-I1yYQg

[Survived] ObjectLiteral
src/services/auth.service.ts:78:14
 
   async getProfile(userId: string) {
     const user = await prisma.user.findUnique({
-      where: { id: userId },
+      where: {},
       select: {
         id: true,

[Survived] ObjectLiteral
src/services/auth.service.ts:79:15
   async getProfile(userId: string) {
     const user = await prisma.user.findUnique({
       where: { id: userId },
-      select: {
-        id: true,
-        email: true,
-        displayName: true,
-        avatarUrl: true,
-        createdAt: true,
-        updatedAt: true,
-      },
+      select: {},
     })
 

[Survived] BooleanLiteral
src/services/auth.service.ts:83:20
         id: true,
         email: true,
         displayName: true,
-        avatarUrl: true,
+        avatarUrl: false,
         createdAt: true,
         updatedAt: true,

[Survived] BooleanLiteral
src/services/auth.service.ts:84:20
         email: true,
         displayName: true,
         avatarUrl: true,
-        createdAt: true,
+        createdAt: false,
         updatedAt: true,
       },

[Killed] BlockStatement
src/services/auth.service.ts:89:16
       },
     })
 
-    if (!user) {
-      throw new AuthError('ユーザーが見つかりません', 404)
-    }
+    if (!user) {}
 
     return user
killedBy: All tests
statusReason: > server@1.0.0 test
> vitest run




 RUN  v4.1.10 /Users/yatabekotaro/local-repo/brain-training-app/server/.stryker-tmp/sandbox-I1yYQg

[Killed] BlockStatement
src/services/auth.service.ts:97:48
   },
 }
 
-function generateToken(userId: string): string {
-  return jwt.sign({ userId }, env.JWT_SECRET, {
-    expiresIn: env.JWT_EXPIRES_IN,
-  })
-}
+function generateToken(userId: string): string {}
 
 export function verifyToken(token: string): { userId: string } {
killedBy: All tests
statusReason: > server@1.0.0 test
> vitest run




 RUN  v4.1.10 /Users/yatabekotaro/local-repo/brain-training-app/server/.stryker-tmp/sandbox-I1yYQg

[Survived] ObjectLiteral
src/services/auth.service.ts:98:19
 }
 
 function generateToken(userId: string): string {
-  return jwt.sign({ userId }, env.JWT_SECRET, {
+  return jwt.sign({}, env.JWT_SECRET, {
     expiresIn: env.JWT_EXPIRES_IN,
   })

[Survived] ObjectLiteral
src/services/auth.service.ts:98:47
 }
 
 function generateToken(userId: string): string {
-  return jwt.sign({ userId }, env.JWT_SECRET, {
-    expiresIn: env.JWT_EXPIRES_IN,
-  })
+  return jwt.sign({ userId }, env.JWT_SECRET, {})
 }
 

[Survived] BlockStatement
src/services/auth.service.ts:103:64
   })
 }
 
-export function verifyToken(token: string): { userId: string } {
-  try {
-    const decoded = jwt.verify(token, env.JWT_SECRET) as { userId: string }
-    return decoded
-  } catch {
-    throw new AuthError('認証に失敗しました', 401)
-  }
-}
+export function verifyToken(token: string): { userId: string } {}
 

[Survived] BlockStatement
src/services/auth.service.ts:104:7
 }
 
 export function verifyToken(token: string): { userId: string } {
-  try {
-    const decoded = jwt.verify(token, env.JWT_SECRET) as { userId: string }
-    return decoded
-  } catch {
+  try {} catch {
     throw new AuthError('認証に失敗しました', 401)
   }

[Survived] BlockStatement
src/services/auth.service.ts:107:11
   try {
     const decoded = jwt.verify(token, env.JWT_SECRET) as { userId: string }
     return decoded
-  } catch {
-    throw new AuthError('認証に失敗しました', 401)
-  }
+  } catch {}
 }
 
