[Killed] MethodExpression
src/types/auth.ts:5:13
 
 export const registerSchema = z.object({
   email: z.string().email('有効なメールアドレスを入力してください'),
-  password: z.string().min(8, 'パスワードは8文字以上で入力してください'),
+  password: z.string().max(8, 'パスワードは8文字以上で入力してください'),
   displayName: z.string().min(1, '表示名を入力してください').max(50),
 })
killedBy: All tests
statusReason: > server@1.0.0 test
> vitest run




 RUN  v4.1.10 /Users/yatabekotaro/local-repo/brain-training-app/server/.stryker-tmp/sandbox-I1yYQg

[Killed] MethodExpression
src/types/auth.ts:6:16
 export const registerSchema = z.object({
   email: z.string().email('有効なメールアドレスを入力してください'),
   password: z.string().min(8, 'パスワードは8文字以上で入力してください'),
-  displayName: z.string().min(1, '表示名を入力してください').max(50),
+  displayName: z.string().max(1, '表示名を入力してください').max(50),
 })
 
killedBy: All tests
statusReason: > server@1.0.0 test
> vitest run



 RUN  v4.1.10 /Users/yatabekotaro/local-repo/brain-training-app/server/.stryker-tmp/sandbox-I1yYQg

[Killed] MethodExpression
src/types/auth.ts:6:16
 export const registerSchema = z.object({
   email: z.string().email('有効なメールアドレスを入力してください'),
   password: z.string().min(8, 'パスワードは8文字以上で入力してください'),
-  displayName: z.string().min(1, '表示名を入力してください').max(50),
+  displayName: z.string().min(1, '表示名を入力してください').min(50),
 })
 
killedBy: All tests
statusReason: > server@1.0.0 test
> vitest run



 RUN  v4.1.10 /Users/yatabekotaro/local-repo/brain-training-app/server/.stryker-tmp/sandbox-I1yYQg

[Survived] ObjectLiteral
src/types/auth.ts:9:37
   displayName: z.string().min(1, '表示名を入力してください').max(50),
 })
 
-export const loginSchema = z.object({
-  email: z.string().email('有効なメールアドレスを入力してください'),
-  password: z.string().min(1, 'パスワードを入力してください'),
-})
+export const loginSchema = z.object({})
 
 export type RegisterInput = z.infer<typeof registerSchema>

[Survived] StringLiteral
src/types/auth.ts:10:27
 })
 
 export const loginSchema = z.object({
-  email: z.string().email('有効なメールアドレスを入力してください'),
+  email: z.string().email(""),
   password: z.string().min(1, 'パスワードを入力してください'),
 })

[Killed] MethodExpression
src/types/auth.ts:11:13
 
 export const loginSchema = z.object({
   email: z.string().email('有効なメールアドレスを入力してください'),
-  password: z.string().min(1, 'パスワードを入力してください'),
+  password: z.string().max(1, 'パスワードを入力してください'),
 })
 
killedBy: All tests
statusReason: > server@1.0.0 test
> vitest run




 RUN  v4.1.10 /Users/yatabekotaro/local-repo/brain-training-app/server/.stryker-tmp/sandbox-I1yYQg
