[Survived] LogicalOperator
src/config/prisma.ts:7:23
   prisma: PrismaClient | undefined
 }
 
-export const prisma = globalForPrisma.prisma ?? new PrismaClient()
+export const prisma = globalForPrisma.prisma && new PrismaClient()
 
 if (process.env.NODE_ENV !== 'production') globalForPrisma.prisma = prisma

[Survived] EqualityOperator
src/config/prisma.ts:9:5
 
 export const prisma = globalForPrisma.prisma ?? new PrismaClient()
 
-if (process.env.NODE_ENV !== 'production') globalForPrisma.prisma = prisma
+if (process.env.NODE_ENV === 'production') globalForPrisma.prisma = prisma
 

[Survived] ConditionalExpression
src/config/prisma.ts:9:5
 
 export const prisma = globalForPrisma.prisma ?? new PrismaClient()
 
-if (process.env.NODE_ENV !== 'production') globalForPrisma.prisma = prisma
+if (false) globalForPrisma.prisma = prisma
 
