[Survived] BlockStatement
src/index.ts:14:32
 
 app.use('/api/auth', authRoutes)
 
-app.get('/health', (_, res) => {
-  res.json({ status: 'ok', timestamp: new Date().toISOString() })
-})
+app.get('/health', (_, res) => {})
 
 app.use((err: Error, _: express.Request, res: express.Response, _next: express.NextFunction) => {

[Survived] BlockStatement
src/index.ts:18:97
   res.json({ status: 'ok', timestamp: new Date().toISOString() })
 })
 
-app.use((err: Error, _: express.Request, res: express.Response, _next: express.NextFunction) => {
-  console.error('Unhandled error:', err)
-  res.status(500).json({ error: 'サーバーエラーが発生しました' })
-})
+app.use((err: Error, _: express.Request, res: express.Response, _next: express.NextFunction) => {})
 
 async function start() {

[Survived] BlockStatement
src/index.ts:23:24
   res.status(500).json({ error: 'サーバーエラーが発生しました' })
 })
 
-async function start() {
-  try {
-    await prisma.$connect()
-    console.log('Database connected')
-
-    app.listen(env.PORT, () => {
-      console.log(`Server running on port ${env.PORT}`)
-    })
-  } catch (error) {
-    console.error('Failed to start server:', error)
-    process.exit(1)
-  }
-}
+async function start() {}
 
 start()

[Survived] BlockStatement
src/index.ts:24:7
 })
 
 async function start() {
-  try {
-    await prisma.$connect()
-    console.log('Database connected')
-
-    app.listen(env.PORT, () => {
-      console.log(`Server running on port ${env.PORT}`)
-    })
-  } catch (error) {
+  try {} catch (error) {
     console.error('Failed to start server:', error)
     process.exit(1)

[Survived] BlockStatement
src/index.ts:28:32
     await prisma.$connect()
     console.log('Database connected')
 
-    app.listen(env.PORT, () => {
-      console.log(`Server running on port ${env.PORT}`)
-    })
+    app.listen(env.PORT, () => {})
   } catch (error) {
     console.error('Failed to start server:', error)

[Survived] StringLiteral
src/index.ts:29:19
     console.log('Database connected')
 
     app.listen(env.PORT, () => {
-      console.log(`Server running on port ${env.PORT}`)
+      console.log(``)
     })
   } catch (error) {

[Survived] BlockStatement
src/index.ts:31:19
     app.listen(env.PORT, () => {
       console.log(`Server running on port ${env.PORT}`)
     })
-  } catch (error) {
-    console.error('Failed to start server:', error)
-    process.exit(1)
-  }
+  } catch (error) {}
 }
 

[Survived] StringLiteral
src/index.ts:32:19
       console.log(`Server running on port ${env.PORT}`)
     })
   } catch (error) {
-    console.error('Failed to start server:', error)
+    console.error("", error)
     process.exit(1)
   }
